<b><h2><center>MySQL DB Creation

In [1]:
import mysql.connector

In [18]:
mydb = mysql.connector.connect (
    host= "localhost",
    username = "root",
    password = "admin123"
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001C0B5E01FD0>

<b>Creating a Database

In [19]:
mycursor = mydb.cursor()
mycursor.execute("CREATE DATABASE MyDatabase1")

<b>Showing all Databases

In [20]:

mycursor.execute("SHOW DATABASES")

for i in mycursor:
    print(i)

('information_schema',)
('mydatabase',)
('mydatabase1',)
('mysql',)
('performance_schema',)
('sales',)
('sys',)

In [34]:
#Connecting to Sales Database

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="admin123",
  database="mydatabase"
)

In [35]:
mycur = mydb.cursor()

mycur.execute("SHOW DATABASES")

for i in mycur:
    print(i)

('information_schema',)
('mydatabase',)
('mydatabase1',)
('mysql',)
('performance_schema',)
('sales',)
('sys',)

In [36]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="admin123",
  database="mydatabase"
)

mycur = mydb.cursor()

mycur.execute("CREATE TABLE Employee (EmployeeID INT, EmployeeName VARCHAR(25))")

ProgrammingError: 1050 (42S01): Table 'employee' already exists

In [37]:
mycur.execute("SHOW TABLES")

for x in mycur:
    print (x)

('employee',)

In [46]:
mycur.execute("CREATE TABLE Employee1 (EmployeeID INT NOT NULL PRIMARY KEY, EmployeeName VARCHAR(50))")

<B>Inserting Val

In [47]:
sql = "INSERT INTO Employee1 (EmployeeID, EmployeeName) Values(%s,%s)"
val = (101, "John WIck")
mycur.execute(sql, val)

In [48]:
mydb.commit()

In [49]:
print(mycur.rowcount, "record Inserted")

1 record Inserted

<b>Select Query

In [61]:
mycur.execute("SELECT * FROM Employee1")

select_query = mycur.fetchall()

for i in select_query:
    print(i)

(101, 'John WIck')
(102, 'Hilton Chad')

In [59]:
val2=(102, "Hilton Chad")
mycur.execute(sql, val2)

In [60]:
mydb.commit()

<B>Where Query

In [65]:
mycur.execute("SELECT * FROM Employee1 WHERE EmployeeId ='102'")

myresult = mycur.fetchall()

for x in myresult:
  print(x)

(102, 'Hilton Chad')

<b>ORDER by Query

In [71]:
mycur.execute("SELECT * FROM Employee1 ORDER BY EmployeeID DESC")

myresults = mycur.fetchall()

for x in myresults:
    print(x)

(102, 'Hilton Chad')
(101, 'John WIck')

In [ ]:
#DELETE FROM EMPLOYEE1 WHERE EMPLOYEEID= 101
#DROP TABLE EMPLOYEE1
#UPDATE Employee1 SET EmployeeID = '103' WHERE EmployeeName like '%Hilton Chad%'
#SELECT * FROM Employee1 LIMIT 5

<b>JOIN Tables